package written_examination.autumn.autumn39_webank.webank03;

/**
 * @author linweida
 * 2021/10/14 3:07 下午
 */
/*
序列解构
时间限制： 5000MS
内存限制： 589824KB
题目描述：
       已知一个长度为n的序列A。我们求出了它的前缀序列，但是却不小心把它的原序列丢失了，请你从它的前缀序列中推出它的原序列，并输出出来。

       这里的前缀序列B定义为，B[i]为所有下标小于等于i中的元素中，所有奇数位置的和减去所有偶数位置的和。A序列和B序列的下标均从1开始。



输入描述
      输入第一行仅包含一个正整数n，表示序列的长度。(1<=n<=10000)

      输入第二行包含n个整数，空格隔开，表示一个前缀序列，所有整数的绝对值都小于等于10^9。

输出描述
输出仅包含一行，包含n个整数，表示原序列，中间用空格隔开。


样例输入
4
1 -1 2 -2
样例输出
1 2 3 4
 */
public class Main {
}
